zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/cy8c4147lqe_s465.h
/*******************************************************************************
*                                    SPCIF
*******************************************************************************/

#define SPCIF_BASE                              0x40110000UL
#define SPCIF                                   ((SPCIF_Type*) SPCIF_BASE)                                        /* 0x40110000 */

/*******************************************************************************
*                                    TCPWM
*******************************************************************************/

#define TCPWM_BASE                              0x40200000UL
#define TCPWM                                   ((TCPWM_Type*) TCPWM_BASE)                                        /* 0x40200000 */
#define TCPWM_CNT0                              ((TCPWM_CNT_Type*) &TCPWM->CNT[0])                                /* 0x40200100 */
#define TCPWM_CNT1                              ((TCPWM_CNT_Type*) &TCPWM->CNT[1])                                /* 0x40200140 */
#define TCPWM_CNT2                              ((TCPWM_CNT_Type*) &TCPWM->CNT[2])                                /* 0x40200180 */
#define TCPWM_CNT3                              ((TCPWM_CNT_Type*) &TCPWM->CNT[3])                                /* 0x402001C0 */
#define TCPWM_CNT4                              ((TCPWM_CNT_Type*) &TCPWM->CNT[4])                                /* 0x40200200 */
#define TCPWM_CNT5                              ((TCPWM_CNT_Type*) &TCPWM->CNT[5])                                /* 0x40200240 */
#define TCPWM_CNT6                              ((TCPWM_CNT_Type*) &TCPWM->CNT[6])                                /* 0x40200280 */
#define TCPWM_CNT7                              ((TCPWM_CNT_Type*) &TCPWM->CNT[7])                                /* 0x402002C0 */

/*******************************************************************************
*                                     WCO
*******************************************************************************/

#define WCO_BASE                                0x40220000UL
#define WCO                                     ((WCO_Type*) WCO_BASE)                                            /* 0x40220000 */

/*******************************************************************************
*                                     SCB
*******************************************************************************/

#define SCB0_BASE                               0x40240000UL
#define SCB1_BASE                               0x40250000UL
#define SCB2_BASE                               0x40260000UL
#define SCB3_BASE                               0x40270000UL
#define SCB4_BASE                               0x40280000UL
#define SCB0                                    ((CySCB_Type*) SCB0_BASE)                                         /* 0x40240000 */
#define SCB1                                    ((CySCB_Type*) SCB1_BASE)                                         /* 0x40250000 */
#define SCB2                                    ((CySCB_Type*) SCB2_BASE)                                         /* 0x40260000 */
#define SCB3                                    ((CySCB_Type*) SCB3_BASE)                                         /* 0x40270000 */
#define SCB4                                    ((CySCB_Type*) SCB4_BASE)                                         /* 0x40280000 */

/*******************************************************************************
*                                     CSD
*******************************************************************************/

#define CSD0_BASE                               0x40290000UL
#define CSD0                                    ((CSD_Type*) CSD0_BASE)                                           /* 0x40290000 */

/*******************************************************************************
*                                     LCD
*******************************************************************************/

#define LCD_BASE                                0x402A0000UL
#define LCD                                     ((LCD_Type*) LCD_BASE)                                            /* 0x402A0000 */

/*******************************************************************************
*                                    LPCOMP
*******************************************************************************/

#define LPCOMP_BASE                             0x402B0000UL
#define LPCOMP                                  ((LPCOMP_Type*) LPCOMP_BASE)                                      /* 0x402B0000 */

/*******************************************************************************
*                                    CRYPTO
*******************************************************************************/

#define CRYPTO_BASE                             0x402C0000UL
#define CRYPTO                                  ((CRYPTO_Type*) CRYPTO_BASE)                                      /* 0x402C0000 */

/*******************************************************************************
*                                     CAN
*******************************************************************************/

#define CAN_BASE                                0x402E0000UL
#define CAN                                     ((CAN_Type*) CAN_BASE)                                            /* 0x402E0000 */
#define CAN_TX0                                 ((CAN_TX_Type*) &CAN->TX[0])                                      /* 0x402E0020 */
#define CAN_TX1                                 ((CAN_TX_Type*) &CAN->TX[1])                                      /* 0x402E0030 */
#define CAN_TX2                                 ((CAN_TX_Type*) &CAN->TX[2])                                      /* 0x402E0040 */
#define CAN_TX3                                 ((CAN_TX_Type*) &CAN->TX[3])                                      /* 0x402E0050 */
#define CAN_TX4                                 ((CAN_TX_Type*) &CAN->TX[4])                                      /* 0x402E0060 */
#define CAN_TX5                                 ((CAN_TX_Type*) &CAN->TX[5])                                      /* 0x402E0070 */
#define CAN_TX6                                 ((CAN_TX_Type*) &CAN->TX[6])                                      /* 0x402E0080 */
#define CAN_TX7                                 ((CAN_TX_Type*) &CAN->TX[7])                                      /* 0x402E0090 */
#define CAN_RX0                                 ((CAN_RX_Type*) &CAN->RX[0])                                      /* 0x402E00A0 */
#define CAN_RX1                                 ((CAN_RX_Type*) &CAN->RX[1])                                      /* 0x402E00C0 */
#define CAN_RX2                                 ((CAN_RX_Type*) &CAN->RX[2])                                      /* 0x402E00E0 */
#define CAN_RX3                                 ((CAN_RX_Type*) &CAN->RX[3])                                      /* 0x402E0100 */
#define CAN_RX4                                 ((CAN_RX_Type*) &CAN->RX[4])                                      /* 0x402E0120 */
#define CAN_RX5                                 ((CAN_RX_Type*) &CAN->RX[5])                                      /* 0x402E0140 */
#define CAN_RX6                                 ((CAN_RX_Type*) &CAN->RX[6])                                      /* 0x402E0160 */
#define CAN_RX7                                 ((CAN_RX_Type*) &CAN->RX[7])                                      /* 0x402E0180 */
#define CAN_RX8                                 ((CAN_RX_Type*) &CAN->RX[8])                                      /* 0x402E01A0 */
#define CAN_RX9                                 ((CAN_RX_Type*) &CAN->RX[9])                                      /* 0x402E01C0 */
#define CAN_RX10                                ((CAN_RX_Type*) &CAN->RX[10])                                     /* 0x402E01E0 */
#define CAN_RX11                                ((CAN_RX_Type*) &CAN->RX[11])                                     /* 0x402E0200 */
#define CAN_RX12                                ((CAN_RX_Type*) &CAN->RX[12])                                     /* 0x402E0220 */
#define CAN_RX13                                ((CAN_RX_Type*) &CAN->RX[13])                                     /* 0x402E0240 */
#define CAN_RX14                                ((CAN_RX_Type*) &CAN->RX[14])                                     /* 0x402E0260 */
#define CAN_RX15                                ((CAN_RX_Type*) &CAN->RX[15])                                     /* 0x402E0280 */

